byAlex_regularPorousMedia-master/twoPhase/incompressible/RmaxRmin/src/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wedge_1
    {
        type            wedge;
    }

    wedge_2
    {
        type            wedge;
    }

    channelWall
    {
        type            noSlip;
    }

    inlet
    {
//         type            cyclicAMI;
        type            zeroGradient;
//         type            fixedValue;
//         value           uniform (0 0 0);
    }

    outlet
    {
//         type            cyclicAMI;
        type            zeroGradient;
//         type            fixedValue;
//         value           uniform (0 0 0);
    }

    defaultFaces
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
