byAlex_regularPorousMedia-master/twoPhase/incompressible/RmaxRmin/src/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {
        name inlet;

        patchInfo
        {
            type patch;
        }

        constructFrom patches;

        patches (inlet_1);
    }
    {
        name outlet;

        patchInfo
        {
            type patch;
        }

        constructFrom patches;

        patches (outlet_1);
    }
);

// ************************************************************************* //
