byAlex_regularPorousMedia-master/twoPhase/incompressible/RmaxRmin/src/system/setFieldsDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.phase1    0
);

regions
(
    sphereToCell
    {
        centre                  (0 0 0); 
        radius                  0;
        fieldValues
        (
            volScalarFieldValue alpha.phase1    1
            volVectorFieldValue U               (0 0 1e-3)
        );
    }
    zoneToCell
    {
        name    viscousLayerZone;
        fieldValues
        (
            volScalarFieldValue alpha.phase1    0
        );
    }
);


// ************************************************************************* //
