byAlex_regularPorousMedia-master/twoPhase/incompressible/RmaxRmin/src/system/snappyHexMeshSrc/STL_list
channelWall.stl         {type triSurfaceMesh;name channelWall;}
planeChannel3D.stl      {type triSurfaceMesh;name planeChannel3D;}
