byAlex_regularPorousMedia-master/twoPhase/incompressible/RmaxRmin/src/system/snappyHexMeshSrc/refinementSurfaces_list
channelWall{level (2 2); patchInfo{type wall;}}
