byAlex_regularPorousMedia-master/twoPhase/incompressible/RmaxRmin/src/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    AMI1;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name "inlet";
        }
    }
    {
        name    AMI2;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name "outlet";
        }
    }
    {
        name    viscousLayerCellSet;
        type    cellSet;
        action  new;
        source  surfaceToCell;
        sourceInfo
        {
            file            "constant/triSurface/channelWall.stl";
            outsidePoints   ((100 100 100));            // definition of outside
            includeCut      false;                      // cells cut by surface
            includeInside   false;                      // cells not on outside of surf
            includeOutside  false;                      // cells on outside of surf
            nearDistance    20.0;                       // cells with centre near surf
//                                                      // (set to -1 if not used)
            curvature       -100;                       // and near surf curvature
//                                                      // (set to -100 if not used)
        }
    }
    {
        name        viscousLayerZone;
        type        cellZoneSet;
        action      new;
        source      setToCellZone;
        sourceInfo
        {
            set     viscousLayerCellSet;
        }
    }
);

// ************************************************************************* //
